In [7]:
import pandas as p

In [9]:
p.read_excel(r'C:\Users\Dharmesh Singh Jadon\Desktop\Data Set 1.xlsx')

       Name    Batch  Rol No Address
0  Dharmesh     Java      10    Noida
1    Bharat  Phython      12  Aligarh
2    Ganesh     Java      11    Noida
3     Kanha  Phython      13  Aligarh

In [11]:
p.read_csv(r'C:\Users\Dharmesh Singh Jadon\Desktop\Data_Set 1 csv.csv')

       Name    Batch  Rol No Address
0  Dharmesh     Java      10    Noida
1    Bharat  Phython      12  Aligarh
2    Ganesh     Java      11    Noida
3     Kanha  Phython      13  Aligarh

In [14]:
"Hello India|"

'Hello India|'

In [16]:
p.read_csv(r'C:\Users\Dharmesh Singh Jadon\Desktop\Data_Set 1 csv.csv')

       Name    Batch  Rol No Address
0  Dharmesh     Java      10    Noida
1    Bharat  Phython      12  Aligarh
2    Ganesh     Java      11    Noida
3     Kanha  Phython      13  Aligarh

In [19]:
p.read_csv(r'C:\Users\Dharmesh Singh Jadon\Desktop\data_set.tsv',sep='\t')

     Name    Batch  Roll No  Address
0   parth     Java       10    Noida
1  Bharat   Python       11  Aligarh
2   Kanha     Java       12  Aligarh
3  Ganesh  Phython       13    Noida